#ifndef __CONFIG_H
#define __CONFIG_H

//无符号类型的定义


//---------------------------------------------------

//全局宏的定义


//----------------------------------------------------

//全局类型的定义
typedef enum{ FALSE = 0, TRUE = !FALSE}BOOL;

//----------------------------------------------------



#ifdef MAIN_CONFIG	//头文件被多个C调用时，避免变量冲突
	#define EXT
#else
	#define EXT extern
#endif		
	

//-----------------------------------------------------	

//常用头文件包含
#include "stm32f1xx.h"   //芯片基础头文件
#include "stdio.h"
#include "string.h"
#include "math.h"
#include <stdarg.h>
#include <stdbool.h>
#include <stdlib.h>	

//-----------------------------------------------------	
#include "system.h" // 系统滴答、HAL库、时钟初始化	
	
//第三方库文件包含	
#include "multi_timer.h" // 系统滴答、HAL库、时钟初始化		
	
	
//全局变量的定义，请用EXT修饰
EXT unsigned char g_var;

//----------------------------------------------------	
#endif


/******************************************************************************************************************
**										End of File
******************************************************************************************************************/

